const config = require('../../../config');

const BODY =
  '位于灰坪乡杜家田村以西，因洞崖滴水，常年不绝，其中的碳酸钙在地表凝析成管关中空的白色石柱，宛似塔形，故以此“白塔”命名。该洞进口狭窄，仅可容一人，盛夏季节凉风飕飕，茫茫白雾从洞内喷出，寒气袭人，令人生畏。现已探明主洞总长6000米、支洞线长3000余米，面积约2万多平方米，洞内不仅有宏伟壮观的罕见3座白塔，还有千姿百态的仙桥、天窗、观厅、真龙潭、地下河、金银山、石钟、石鼓等百余个奇、丽、险景观，层层梯田，与石花果、石笋相映密布，令人神往。\n' +
  '该洞共分二层：\n' +
  '第一层：崖顶滴水如珠不绝，凝成白鹅管石，宛似一对白塔相峙。近视，见之如琢似削，水晶凝结，旁有翠碧，碧玉悬身，犹如尊尊佛像；左侧，雪山灿然；望前，两壁色黄，似火烛之光彩，在火焰映照下，有大片金色，闪光若龙鳞；\n' +
  '第二层：曲而深，有龙潭，水声汹涌，进内需过天桥，每前一步，步步惊险奇特，使人不敢深入，又迫人急切深入探奇，此情此景，非一般洞景所能媲美。尤其在风清月明时，洞内水声如仙乐，清•徐崇奎游洞闻潮声赋诗：\n' +
  '尘心应涤尽，拄杖过溪桥。\n' +
  '古洞携云入，枯松缚炬烧。\n' +
  '泉香流石髓，岩润茁芝苗。\n' +
  '澎湃真奇绝，来听地底潮。\n\n' +
  '明徐日久《游白塔洞记》：\n' +
  '……洞内甚小，进先有足，既入乃燃火把，则高厅瑰磊，殊非意想所及……，临下甚黑，渡水方龙潭，光景尤奇。然使人有不敢更入之意矣！';

Page({
  data: {
    baseUrl: config.baseUrl,
    body: BODY
  },

  onBack() {
    wx.navigateBack({ delta: 1 });
  }
});
